steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
    String fileUrl = base + String(downloadBaseRaw) + fileName;
    HTTPClient fileHttp;
    configureHttpClient(fileHttp, 60000);
    const char* fileHeaders[] = {"Content-Type"};
    fileHttp.collectHeaders(fileHeaders, 1);
    if (!fileHttp.begin(fileUrl)) continue;
    fileHttp.addHeader("Authorization", "Bearer " + cfg.device_token);
    int code = fileHttp.GET();
    const String fileContentType = fileHttp.header("Content-Type");
    if (code != HTTP_CODE_OK || fileHttp.getSize() != (int)packedSize
        || !fileContentType.startsWith("application/octet-stream")) {
      fileHttp.end();
      continue;
    }

    WiFiClient *stream = fileHttp.getStreamPtr();
    size_t total = 0;
    uint32_t started = millis();
    while (total < packedSize && millis() - started < 60000) {
      size_t available = stream->available();
      if (!available) {
        if (!fileHttp.connected()) break;
        delay(1);
        continue;
      }
      size_t count = min(available, packedSize - total);
      int received = stream->read(packed + total, count);
      if (received > 0) total += received;
    }
    fileHttp.end();
    if (total != packedSize) continue;

    unsigned char digest[32];
    if (calculateSha256(packed, packedSize, digest) != 0) continue;
    char actualSha[65];
    for (int i = 0; i < 32; ++i) sprintf(actualSha + i * 2, "%02x", digest[i]);
    actualSha[64] = '\0';
    if (!expectedSha.equalsIgnoreCase(String(actualSha))) continue;
    currentPayloadShaVerified = true;
    currentPayloadIntegrityTrusted = true;
    currentPayloadSha256 = expectedSha;

    // 完整下載與 SHA-256 都通過後才替換資料。
    if (frameData) heap_caps_free(frameData);
#if INKTIME_PHOTOPAINTER_ENABLED
    uint8_t* nativeFrame = nullptr;
    if (!photoPainter.convertAndCache(
          packed,
          packedSize,
          indexed4,
          sourceHash,
          rotation,
          &nativeFrame,
          expectedSha.c_str())) {
      frameData = nullptr;
      lastDeviceErrorCode = photoPainter.lastError();
      lastDeviceErrorMessage = "PhotoPainter framebuffer 轉換失敗";
      continue;
    }
    heap_caps_free(packed);
    frameData = nativeFrame;
    frameDataSize = inktime::kPhotoPainterFrameBytes;
    frameIndexed4 = true;
    frameNativePalette = true;
#else
    frameData = packed;
    frameDataSize = packedSize;
    frameIndexed4 = indexed4;
    frameNativePalette = false;
#endif
    currentReleaseId = manifest["release_id"] | "";
    currentRenderProfile = renderProfile;
#if INKTIME_PHOTOPAINTER_ENABLED
    saveLastPhotoIndex(fileIndex);
#endif
    return true;
  }

  heap_caps_free(packed);
  lastDeviceErrorCode = "DEVICE-DOWNLOAD";
  lastDeviceErrorMessage = "所有發布檔案下載或 SHA-256 校驗失敗";
  return false;
}

#if INKTIME_PHOTOPAINTER_ENABLED
static bool downloadOfflineScheduleSlot(
  const Config &cfg,
  const String &base,
  const String &downloadUrl,
  const String &expectedSha,
  const String &pixelFormat,
  int64_t expectedSize
) {
  if (!inktime::isSha256Hex(expectedSha.c_str())
      || !inktime::isSafeQueueDownloadPath(downloadUrl.c_str(), downloadUrl.length())) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-ITEM";
    lastDeviceErrorMessage = "離線排程 Slot 身分或下載路徑不合法";
    return false;
  }
  const bool indexed4 = pixelFormat == "indexed4";
  if (pixelFormat != "indexed4" && pixelFormat != "2bpp") {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-ITEM";
    lastDeviceErrorMessage = "離線排程 Slot pixel_format 不相容";
    return false;
  }
  const size_t packedSize = static_cast<size_t>(FB_WIDTH) * FB_HEIGHT
    / (indexed4 ? 2U : 4U);
  if (expectedSize != static_cast<int64_t>(packedSize)) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-SIZE";
    lastDeviceErrorMessage = "離線排程 Slot size 與 pixel format 不一致";
    return false;
  }
  uint8_t* packed = photoPainter.allocateWireBuffer(packedSize);
  if (packed == nullptr) {
    lastDeviceErrorCode = "DEVICE-MEMORY";
    lastDeviceErrorMessage = "無法配置離線排程 Slot 緩衝區";
    return false;
  }
  HTTPClient fileHttp;
  configureHttpClient(fileHttp, 60000);
  const char* fileHeaders[] = {"Content-Type"};
  fileHttp.collectHeaders(fileHeaders, 1);
  if (!fileHttp.begin(base + downloadUrl)) {
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-URL";
    lastDeviceErrorMessage = "離線排程 Slot URL 無法初始化";
    return false;
  }
  fileHttp.addHeader("Authorization", "Bearer " + cfg.device_token);
  const int fileStatus = fileHttp.GET();
  const String fileContentType = fileHttp.header("Content-Type");
  if (fileStatus != HTTP_CODE_OK || fileHttp.getSize() != static_cast<int>(packedSize)
      || !fileContentType.startsWith("application/octet-stream")) {
    fileHttp.end();
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-DOWNLOAD";
    lastDeviceErrorMessage = "離線排程 Slot HTTP／Content-Type／長度不合法";
    return false;
  }
  WiFiClient* stream = fileHttp.getStreamPtr();
  size_t total = 0U;
  const uint32_t started = millis();
  while (total < packedSize && millis() - started < 60000U) {
    const size_t available = stream->available();
    if (available == 0U) {
      if (!fileHttp.connected()) break;
      delay(1);
      continue;
    }
    const size_t count = min(available, packedSize - total);
    const int received = stream->read(packed + total, count);
    if (received > 0) total += static_cast<size_t>(received);
  }
  fileHttp.end();
  if (total != packedSize) {
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-DOWNLOAD";
    lastDeviceErrorMessage = "離線排程 Slot Payload 未完整下載";
    return false;
  }
  unsigned char digest[32];
  if (calculateSha256(packed, packedSize, digest) != 0) {
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-HASH";
    lastDeviceErrorMessage = "離線排程 Slot SHA-256 計算失敗";
    return false;
  }
  char actualSha[65];
  for (size_t index = 0; index < 32U; ++index) {
    snprintf(actualSha + index * 2U, 3U, "%02x", digest[index]);
  }
  actualSha[64] = '\0';
  if (!expectedSha.equalsIgnoreCase(String(actualSha))) {
    heap_caps_free(packed);
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-HASH";
    lastDeviceErrorMessage = "離線排程 Slot SHA-256 不一致";
    return false;
  }
  const inktime::DisplayRotation rotation = cfg.rotate180
    ? inktime::DisplayRotation::Rotate180
    : inktime::DisplayRotation::Rotate0;
  uint8_t* nativeFrame = nullptr;
  const uint32_t sourceHash = inktime::sourceHash32(expectedSha.c_str());
  const bool converted = photoPainter.convertAndCache(
    packed,
    packedSize,
    indexed4,
    sourceHash,
    rotation,
    &nativeFrame,
    expectedSha.c_str());
  heap_caps_free(packed);
  if (!converted || nativeFrame == nullptr) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-FRAME";
    lastDeviceErrorMessage = "離線排程正式 Frame 轉換失敗";
    return false;
  }
  const bool written = photoPainter.writeFormalFrame(
    expectedSha.c_str(), rotation, nativeFrame, inktime::kPhotoPainterFrameBytes);
  heap_caps_free(nativeFrame);
  if (!written) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-FRAME";
    lastDeviceErrorMessage = "離線排程正式 Frame 無法原子寫入 SD";
    return false;
  }
  return true;
}

static bool downloadOfflineScheduleAndFrames(Config &cfg) {
  String base;
  if (cfg.backend_hostport.length() == 0 || cfg.device_token.length() == 0
      || !normalizedBackendBase(cfg, base)) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-CONFIG";
    lastDeviceErrorMessage = "離線排程缺少 Backend 或裝置 Token";
    return false;
  }
  HTTPClient scheduleHttp;
  configureHttpClient(scheduleHttp, 30000);
  const char* scheduleHeaders[] = {"Content-Type"};
  scheduleHttp.collectHeaders(scheduleHeaders, 1);
  if (!scheduleHttp.begin(base + String(DEVICE_OFFLINE_SCHEDULE_PATH))) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-URL";
    lastDeviceErrorMessage = "離線排程 URL 無法初始化";
    return false;
  }
  scheduleHttp.addHeader("Authorization", "Bearer " + cfg.device_token);
  const int status = scheduleHttp.GET();
  const int length = scheduleHttp.getSize();
  const String contentType = scheduleHttp.header("Content-Type");
  if (status == HTTP_CODE_NOT_FOUND && length > 0 && length <= 4096
      && contentType.startsWith("application/json")) {
    JsonDocument notReady;
    const DeserializationError notReadyError = deserializeJson(notReady, scheduleHttp.getStream());
    scheduleHttp.end();
    const String errorName = notReady["error"] | "";
    const JsonVariantConst rawRetryEpoch = notReady["retry_after_epoch"];
    const JsonVariantConst rawNextSlotEpoch = notReady["next_slot_epoch"];
    int64_t serverRetryEpoch = 0;
    int64_t nextSlotEpoch = 0;
    bool nextSlotFieldValid = rawNextSlotEpoch.isNull();
    if (!notReadyError && !notReady.overflowed()
        && errorName == "schedule_not_ready"
        && rawRetryEpoch.is<int64_t>() && !rawRetryEpoch.is<bool>()) {
      serverRetryEpoch = rawRetryEpoch.as<int64_t>();
    }
    if (!notReadyError && !notReady.overflowed()
        && errorName == "schedule_not_ready"
        && rawNextSlotEpoch.is<int64_t>() && !rawNextSlotEpoch.is<bool>()
        && rawNextSlotEpoch.as<int64_t>() > 0) {
      nextSlotEpoch = rawNextSlotEpoch.as<int64_t>();
      nextSlotFieldValid = true;
    }
    if (!nextSlotFieldValid) {
      serverRetryEpoch = 0;
      nextSlotEpoch = 0;
    }
    time_t recoveryNow = time(nullptr);
    if (recoveryNow <= 0) (void)photoPainter.readRtc(recoveryNow);
    if (errorName == "schedule_not_ready") {
      const time_t retryEpoch = scheduleOfflineRecovery(
        recoveryNow, serverRetryEpoch, nextSlotEpoch);
      lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-NOT-READY";
      lastDeviceErrorMessage = retryEpoch > recoveryNow
        ? "伺服器尚未準備今日離線排程；已保存 bounded retry epoch"
        : "伺服器尚未準備今日離線排程；時間無效，使用 bounded fallback";
      return false;
    }
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-HTTP";
    lastDeviceErrorMessage = "離線排程 schedule_not_ready JSON 不合法";
    return false;
  }
  if (status != HTTP_CODE_OK || length <= 0 || length > 32768
      || !contentType.startsWith("application/json")) {
    scheduleHttp.end();
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-HTTP";
    lastDeviceErrorMessage = "離線排程 HTTP／Content-Type／長度不合法";
    return false;
  }
  JsonDocument schedule;
  const DeserializationError jsonError = deserializeJson(schedule, scheduleHttp.getStream());
  scheduleHttp.end();
  const JsonVariantConst schema = schedule["schema_version"];
  const JsonVariantConst rawSlots = schedule["slots"];
  const String deliveryMode = schedule["delivery_mode"] | "";
  const String targetLocalDate = schedule["target_local_date"] | "";
  const String targetDate = schedule["target_date"] | "";
  const String timezoneName = schedule["timezone"] | "";
  const String scheduleId = schedule["schedule_id"] | "";
  const String panelProfile = schedule["panel_profile"] | "";
  const String buttonWakeAction = schedule["button_wake_action"] | "";
  const JsonVariantConst rawConfigVersion = schedule["config_version"];
  const JsonVariantConst rawRotation = schedule["rotation"];
  const JsonVariantConst rawScheduleVersion = schedule["offline_schedule_version"];
  const JsonVariantConst rawTargetStartEpoch = schedule["target_start_epoch"];
  const JsonVariantConst rawTargetEndEpoch = schedule["target_end_epoch"];
  if (jsonError || schedule.overflowed() || !schema.is<int32_t>() || schema.is<bool>()
      || schema.as<int32_t>() != 1 || deliveryMode != "inktime_offline_schedule"
      || !rawSlots.is<JsonArrayConst>() || targetLocalDate.length() == 0U
      || (targetDate.length() > 0U && targetDate != targetLocalDate)
      || timezoneName.length() == 0U || timezoneName.length() > 64U
      || scheduleId.length() == 0U
      || !inktime::boundedText(scheduleId.c_str(), inktime::kQueueIdentifierMaxBytes)
      || panelProfile.length() == 0U || !buttonWakeAction.length()
      || !rawConfigVersion.is<uint32_t>() || rawConfigVersion.is<bool>()
      || !rawRotation.is<int32_t>() || rawRotation.is<bool>()
      || !rawScheduleVersion.is<int32_t>() || rawScheduleVersion.is<bool>()
      || rawScheduleVersion.as<int32_t>() < 0
      || !rawTargetStartEpoch.is<int64_t>() || rawTargetStartEpoch.is<bool>()
      || !rawTargetEndEpoch.is<int64_t>() || rawTargetEndEpoch.is<bool>()
      || rawTargetStartEpoch.as<int64_t>() <= 0
      || rawTargetEndEpoch.as<int64_t>() <= rawTargetStartEpoch.as<int64_t>()) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-SCHEMA";
    lastDeviceErrorMessage = "離線排程 schema、日期或快照欄位不相容";
    return false;
  }
  const JsonArrayConst slots = rawSlots.as<JsonArrayConst>();
  if (slots.size() == 0U || slots.size() > inktime::kMaxOfflineSlots) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-COUNT";
    lastDeviceErrorMessage = "離線排程 Slot 數量超過裝置上限";
    return false;
  }
  Config scheduleCandidate = cfg;
  JsonArrayConst rawTimes = schedule["schedule_times"].as<JsonArrayConst>();
  if (rawTimes.isNull()) rawTimes = schedule["schedule"].as<JsonArrayConst>();
  if (rawTimes.isNull() || rawTimes.size() == 0U
      || rawTimes.size() > inktime::kMaxOfflineSlots || rawTimes.size() != slots.size()) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-SCHEMA";
    lastDeviceErrorMessage = "離線排程 schedule_times 不合法";
    return false;
  }
  inktime::OfflineSlot scheduleSlots[inktime::kMaxOfflineSlots] = {};
  for (size_t index = 0; index < rawTimes.size(); ++index) {
    if (!parseOfflineClock(rawTimes[index] | "", scheduleSlots[index])) {
      lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-SCHEMA";
      lastDeviceErrorMessage = "離線排程時刻格式不合法";
      return false;
    }
  }
  if (!inktime::validateOfflineSlots(scheduleSlots, static_cast<uint8_t>(rawTimes.size()))) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-SCHEMA";
    lastDeviceErrorMessage = "離線排程時刻未排序或重複";
    return false;
  }
  time_t rtcEpoch = 0;
  if (!photoPainter.readRtc(rtcEpoch)) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-RTC";
    lastDeviceErrorMessage = "離線排程無法由 PhotoPainter RTC 驗證本地日期";
    return false;
  }
  const int64_t targetStartEpoch = rawTargetStartEpoch.as<int64_t>();
  const int64_t targetEndEpoch = rawTargetEndEpoch.as<int64_t>();
  if (static_cast<int64_t>(rtcEpoch) < targetStartEpoch
      || static_cast<int64_t>(rtcEpoch) >= targetEndEpoch) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-RTC";
    lastDeviceErrorMessage = "離線排程 RTC 不在伺服器授權的目標本地日範圍";
    return false;
  }
  const uint32_t remoteConfigVersion = rawConfigVersion.as<uint32_t>();
  const int32_t remoteRotation = rawRotation.as<int32_t>();
  inktime::OfflineScheduleContract contract = {
    1,
    deliveryMode.c_str(),
    targetLocalDate.c_str(),
    targetLocalDate.c_str(),
    timezoneName.c_str(),
    targetStartEpoch,
    targetEndEpoch,
    static_cast<int64_t>(rtcEpoch),
    remoteConfigVersion,
    cfg.config_version,
    remoteRotation,
    panelProfile.c_str(),
    INKTIME_PANEL_PROFILE,
    buttonWakeAction.c_str(),
    static_cast<uint8_t>(slots.size()),
    static_cast<uint8_t>(rawTimes.size()),
    true,
    true,
    true,
  };
  int64_t previousShowAtEpoch = 0;
  for (size_t index = 0; index < slots.size(); ++index) {
    const JsonVariantConst rawSlot = slots[index];
    if (!rawSlot.is<JsonObjectConst>()) {
      contract.queueIdentityValid = false;
      contract.sha256Valid = false;
      break;
    }
    const JsonObjectConst slot = rawSlot.as<JsonObjectConst>();
    const JsonVariantConst rawSize = slot["size"];
    const JsonVariantConst rawWidth = slot["width"];
    const JsonVariantConst rawHeight = slot["height"];
    const JsonVariantConst rawSlotIndex = slot["slot_index"];
    const JsonVariantConst rawQueueVersion = slot["queue_version"];
    const JsonVariantConst rawShowAtEpoch = slot["show_at_epoch"];
    const String itemId = slot["queue_item_id"] | "";
    const String releaseId = slot["release_id"] | "";
    const String slotScheduleId = slot["offline_schedule_id"] | "";
    const String sha = slot["sha256"] | "";
    const String downloadUrl = slot["download_url"] | "";
    const String pixelFormat = slot["pixel_format"] | "";
    const String renderProfile = slot["render_profile"] | "";
    const bool indexed4 = pixelFormat == "indexed4";
    const int64_t expectedSize = static_cast<int64_t>(FB_WIDTH) * FB_HEIGHT
      / (indexed4 ? 2 : 4);
    const bool validIdentity = rawSlot.is<JsonObjectConst>()
      && rawSlotIndex.is<int32_t>() && !rawSlotIndex.is<bool>()
      && rawSlotIndex.as<int32_t>() == static_cast<int32_t>(index)
      && rawQueueVersion.is<int32_t>() && !rawQueueVersion.is<bool>()
      && rawQueueVersion.as<int32_t>() >= 0
      && inktime::boundedText(itemId.c_str(), inktime::kQueueIdentifierMaxBytes)
      && inktime::boundedText(releaseId.c_str(), inktime::kQueueIdentifierMaxBytes)
      && inktime::boundedText(slotScheduleId.c_str(), inktime::kQueueIdentifierMaxBytes)
      && slotScheduleId == scheduleId
      && inktime::isSafeQueueDownloadPathForItem(
           downloadUrl.c_str(), downloadUrl.length(), itemId.c_str())
      && (renderProfile == "safe_4c" || renderProfile == String(INKTIME_PANEL_PROFILE));
    const bool validPayload = rawSize.is<int64_t>() && !rawSize.is<bool>()
      && rawSize.as<int64_t>() == expectedSize
      && rawWidth.is<int32_t>() && !rawWidth.is<bool>()
      && rawHeight.is<int32_t>() && !rawHeight.is<bool>()
      && rawWidth.as<int32_t>() == FB_WIDTH && rawHeight.as<int32_t>() == FB_HEIGHT
      && (pixelFormat == "indexed4" || pixelFormat == "2bpp")
      && inktime::isSha256Hex(sha.c_str());
    const bool validShowAtEpoch = rawShowAtEpoch.is<int64_t>() && !rawShowAtEpoch.is<bool>()
      && rawShowAtEpoch.as<int64_t>() >= targetStartEpoch
      && rawShowAtEpoch.as<int64_t>() < targetEndEpoch
      && (index == 0U || rawShowAtEpoch.as<int64_t>() > previousShowAtEpoch);
    contract.queueIdentityValid = contract.queueIdentityValid && validIdentity;
    contract.sha256Valid = contract.sha256Valid && validPayload;
    contract.slotEpochsValid = contract.slotEpochsValid && validShowAtEpoch;
    if (validShowAtEpoch) previousShowAtEpoch = rawShowAtEpoch.as<int64_t>();
  }
  if (!inktime::validOfflineScheduleContract(contract)) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-SCHEMA";
    lastDeviceErrorMessage = "離線排程快照過期、日期錯誤或 Slot 完整性不合法";
    return false;
  }
  scheduleCandidate.schedule_count = static_cast<uint8_t>(rawTimes.size());
  for (uint8_t index = 0; index < scheduleCandidate.schedule_count; ++index) {
    scheduleCandidate.schedule_slots[index] = scheduleSlots[index];
  }
  scheduleCandidate.refresh_hour = scheduleSlots[0].hour;
  scheduleCandidate.refresh_minute = scheduleSlots[0].minute;
  scheduleCandidate.rotate180 = remoteRotation == 180;
  scheduleCandidate.delivery_mode = deliveryMode;
  scheduleCandidate.button_wake_action = buttonWakeAction;
  scheduleCandidate.config_version = remoteConfigVersion;
  const JsonVariantConst rawLead = schedule["prefetch_lead_minutes"];
  if (!rawLead.is<int32_t>() || rawLead.is<bool>()) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-SCHEMA";
    lastDeviceErrorMessage = "離線排程 prefetch_lead_minutes 缺少或型別不合法";
    return false;
  }
  const int remoteLead = rawLead.as<int32_t>();
  if (remoteLead < 0 || remoteLead > 120) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-SCHEMA";
    lastDeviceErrorMessage = "離線排程 prefetch_lead_minutes 不合法";
    return false;
  }
  scheduleCandidate.prefetch_lead_minutes = static_cast<uint16_t>(remoteLead);
  for (size_t index = 0; index < slots.size(); ++index) {
    const JsonVariantConst rawSlot = slots[index];
    if (!rawSlot.is<JsonObjectConst>()) {
      lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-ITEM";
      lastDeviceErrorMessage = "離線排程 Slot 必須是 JSON object";
      return false;
    }
    const JsonObjectConst slot = rawSlot.as<JsonObjectConst>();
    const JsonVariantConst rawSize = slot["size"];
    const JsonVariantConst rawWidth = slot["width"];
    const JsonVariantConst rawHeight = slot["height"];
    const JsonVariantConst rawSlotIndex = slot["slot_index"];
    const JsonVariantConst rawQueueVersion = slot["queue_version"];
    const JsonVariantConst rawShowAtEpoch = slot["show_at_epoch"];
    const String itemId = slot["queue_item_id"] | "";
    const String releaseId = slot["release_id"] | "";
    const String sha = slot["sha256"] | "";
    const String downloadUrl = slot["download_url"] | "";
    const String pixelFormat = slot["pixel_format"] | "";
    const String renderProfile = slot["render_profile"] | "";
    if (!rawSize.is<int64_t>() || rawSize.is<bool>()
        || !rawWidth.is<int32_t>() || rawWidth.is<bool>()
        || !rawHeight.is<int32_t>() || rawHeight.is<bool>()
        || !rawSlotIndex.is<int32_t>() || rawSlotIndex.is<bool>()
        || rawSlotIndex.as<int32_t>() != static_cast<int32_t>(index)
        || !rawQueueVersion.is<int32_t>() || rawQueueVersion.is<bool>()
        || rawQueueVersion.as<int32_t>() < 0
        || !rawShowAtEpoch.is<int64_t>() || rawShowAtEpoch.is<bool>()
        || rawShowAtEpoch.as<int64_t>() < targetStartEpoch
        || rawShowAtEpoch.as<int64_t>() >= targetEndEpoch
        || rawWidth.as<int32_t>() != FB_WIDTH || rawHeight.as<int32_t>() != FB_HEIGHT
        || !inktime::isSha256Hex(sha.c_str())
        || !inktime::boundedText(itemId.c_str(), inktime::kQueueIdentifierMaxBytes)
        || !inktime::boundedText(releaseId.c_str(), inktime::kQueueIdentifierMaxBytes)
        || !inktime::isSafeQueueDownloadPathForItem(
             downloadUrl.c_str(), downloadUrl.length(), itemId.c_str())
        || (renderProfile != "safe_4c" && renderProfile != String(INKTIME_PANEL_PROFILE))) {
      lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-ITEM";
      lastDeviceErrorMessage = "離線排程 Slot 身分、尺寸、SHA 或 Profile 不合法";
      return false;
    }
    currentFromQueue = true;
    currentQueueItemId = itemId;
    currentQueueVersion = rawQueueVersion.as<int32_t>();
    currentReleaseId = releaseId;
    currentRenderProfile = renderProfile;
    currentPayloadSha256 = sha;
    currentPayloadShaVerified = false;
    currentPayloadIntegrityTrusted = false;
    if (!sendQueueEvent(cfg, inktime::QueueEvent::ManifestReceived)
        || !sendQueueEvent(cfg, inktime::QueueEvent::DownloadStarted)
        || !downloadOfflineScheduleSlot(
             cfg, base, downloadUrl, sha, pixelFormat, rawSize.as<int64_t>())
        || !sendQueueEvent(cfg, inktime::QueueEvent::DownloadCompleted)) {
      return false;
    }
    currentPayloadShaVerified = true;
    if (!sendQueueEvent(cfg, inktime::QueueEvent::HashVerified)) return false;
  }
  String activeSchedule;
  serializeJson(schedule, activeSchedule);
  if (!photoPainter.writeActiveSchedule(activeSchedule.c_str(), activeSchedule.length())) {
    lastDeviceErrorCode = "DEVICE-OFFLINE-SCHEDULE-STAGE";
    lastDeviceErrorMessage = "離線排程 active schedule 無法原子切換";
    return false;
  }
  cfg = scheduleCandidate;
  saveConfig(cfg);
  serverConfigChanged = true;
  clearOfflineRetryState();
  currentFromQueue = false;
  currentPayloadIntegrityTrusted = true;
  return true;
}
#endif

